Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.IFCLink Property
 An external resource type representing IFC links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType IFCLink { get; }
Public Shared ReadOnly Property IFCLink As ExternalResourceType
	Get
public:
static property ExternalResourceType^ IFCLink {
	ExternalResourceType^ get ();
}
static member IFCLink : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace